// DZ17.5.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>

class Vector
{
public:
    Vector(): x(0), y(0), z(0)
    {}
    Vector(float _x, float _y, float _z): x(_x),y(_y),z(_z)
    {}
    void Show()
    {
        std::cout << '\n' << x << ' ' << y << ' ' << z;
    }
    void Mod()
    {
        float mod = sqrt(pow(x, 2) + pow(y, 2) + pow(z, 2));
        std::cout <<'\n'<< mod;
    }
private:
    float x;
    float y;
    float z;
};

int main()
{
    Vector v (10,4,3);
    v.Show();
    v.Mod();
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
